# =============================================================================
# import numpy as np
# =============================================================================
import cv2

#讀取圖檔
img_gray = cv2.imread('OTTER_1.jpg', cv2.IMREAD_GRAYSCALE)

#顯示圖片
cv2.imshow('OTTER_1.jpg', img_gray)

#按下任意鍵則關閉所有視窗
cv2.waitKey(0)
cv2.destoryAllwindows()

#查看資料型態

cv2.destroyWindow('My Image')

#NumPy陣列的大小
# =============================================================================
# img.shape
# =============================================================================
