import pandas as pd
#[]內多一個()會有不同結果
datas = [[66,70,35,58],[90,65,77,89],[45,80,63,51],\
         [73,70,88,90],[55,67,82,73],[80,67,62,55]]
indexs = ['Kyle','John','Eric','Mike','Rick','Emma']
columns = ['國文','英文','數學','自然']

#index沒有加s為pd預設
df = pd.DataFrame(datas, columns=columns, index=indexs)
# =============================================================================
# print(df)
# =============================================================================
# 測試一、
# =============================================================================
# print('df["自然"] ->')
# print(df["自然"])
# print()
# print('df["國文", "數學", "自然"] ->')
# print(df[["國文", "數學", "自然"]])
# print()
# print('df[df.數學>=80] ->')
# print(df[df.數學 >= 80])
# =============================================================================
# 測試二、
# =============================================================================
# print('英文高於80分的同學，輸出數學跟英文')
# _df = pd.DataFrame(datas, columns=columns, index=indexs)
# _df = _df[df.英文 >= 80]
# print(_df[["數學","英文"]])
# =============================================================================
# 測試三、
# =============================================================================
# print('輸出df的裡頭的data')
# print(df.values)
# print('輸出John的成績')
# print(df.values[1])
# print('輸出John的數學成績')
# print(df.values[1][2])
# =============================================================================
# 測試四、
# A:B 代表從A到B [列, 欄]
# =============================================================================
# print('輸出John的所有成績')
# print(df.loc["John",:])
# 
# print('輸出John的數學成績')
# print(df.loc["John"]["數學"])
# 
# print('輸出John跟Mike的所有成績')
# print(df.loc[("John","Mike"),:])
# 
# print('輸出所有人的數學成績')
# print(df.loc[:,"數學"])
# 
# print('輸出John跟Mike的數學和英文成績')
# print(df.loc[("John","Mike"),("數學","英文")])
# 
# print('輸出John到Rick的所有成績')
# print(df.loc["John":"Rick","國文":"自然"])
# 
# =============================================================================
# 測試五、
#iloc抓位置 loc是抓資料值
# =============================================================================
# print('輸出第2列，全部的欄')
# print(df.iloc[1,:])
# print('輸出第2列，第3欄')
# print(df.iloc[1][2])
# =============================================================================
# 測試六、
# =============================================================================
# print('輸出前2位學生的成績')
# print(df.head(2))
# print('輸出後2位學生的成績')
# print(df.tail(2))
# =============================================================================
# 測試七、
# =============================================================================
# print('Emma的原始英文成績'+str(df.loc["Emma"]["英文"]))
# df.loc["Emma"]["英文"]=75
# print('Emma的修改後英文成績'+str(df.loc["Emma"]["英文"]))
# 
# print('Rick的全部原始成績')
# df.loc["Rick","英文":"數學"]=75
# print('Rick的修改後英文及數學成績'+str(df.loc["Rick","英文":"數學"]))
# =============================================================================



